Revit 2024 API
Camera.FarDistance Property
 Distance to far clipping plane
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public double FarDistance { get; set; }
Visual Basic
Public Property FarDistance As Double
	Get
	Set
Visual C++
public:
property double FarDistance {
	double get ();
	void set (double value);
}
See Also
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace